## Q1

In [11]:
import numpy as np
import pandas as pd

df1_data = [{'name': 'james', 'school':'business'},
            {'name': 'mike', 'school': 'law'},
            {'name': 'sally', 'school': 'engineering'}]
df1 = pd.DataFrame(df1_data).set_index('name')
df1

            school
name
james     business
mike           law
sally  engineering

In [12]:
df2_data = [{'name': 'kelly', 'role':'HR'},
            {'name': 'sally', 'role': 'liason'},
            {'name': 'james', 'role': 'grader'}]
df2 = pd.DataFrame(df2_data).set_index('name')
df2

         role
name
kelly      HR
sally  liason
james  grader

In [22]:
#merge the data sets
df3 = pd.merge(df1, df2, how="left", left_index=True, right_index=True )
df3

            school    role
name
james     business  grader
mike           law     NaN
sally  engineering  liason

## Q2

In [35]:
data = np.random.rand(3,6)
data
col = ['P2010', 'P2011', 'P2012', 'P2013', 'P2014', 'P2015'] 
df = pd.DataFrame(data, columns=col)
df

      P2010     P2011     P2012     P2013     P2014     P2015
0  0.029924  0.109261  0.617667  0.200864  0.284721  0.498370
1  0.840777  0.054489  0.519481  0.005159  0.057418  0.785541
2  0.421021  0.962813  0.856150  0.922113  0.046401  0.063267
      P2010     P2011     P2012     P2013     P2014     P2015       AVG
0  0.029924  0.109261  0.617667  0.200864  0.284721  0.498370  0.290134
1  0.840777  0.054489  0.519481  0.005159  0.057418  0.785541  0.377144
2  0.421021  0.962813  0.856150  0.922113  0.046401  0.063267  0.545294

        AVG
0  0.290134
1  0.377144
2  0.545294

In [36]:
# calculate the average across columns for each row
df['AVG'] = df[col].apply(lambda z: np.mean(z), axis=1)
df

      P2010     P2011     P2012     P2013     P2014     P2015       AVG
0  0.029924  0.109261  0.617667  0.200864  0.284721  0.498370  0.290134
1  0.840777  0.054489  0.519481  0.005159  0.057418  0.785541  0.377144
2  0.421021  0.962813  0.856150  0.922113  0.046401  0.063267  0.545294

In [37]:
#drop the named columns
result_df = df.drop(col, axis=1)
result_df

        AVG
0  0.290134
1  0.377144
2  0.545294

In [1]:
#Q5
# my prelimary answer is 5
import pandas as pd
(pd.Timestamp('11/29/2019') + pd.offsets.MonthEnd()).weekday()

5

In [15]:
# Q6
# initialise data of lists. 
data = {'group_key':['A', 'B', 'A', 'B', 'A'], 
        'marks':[99, 98, 95, 90, 100]} 

# initialise data of lists. 
# data = {'Name':['Tom', 'Jack', 'nick', 'juli'], 
#         'marks':[99, 98, 95, 90]} 
  
# Creates pandas DataFrame. 
df = pd.DataFrame(data)

df
  

# filling_mean = lambda g: g.fillna(g.mean)
# df.group_by(group_key).transform(filling_mean)

  group_key  marks
0         A     99
1         B     98
2         A     95
3         B     90
4         A    100